import stanza

languages = ['en', 'it', 'hi', 'ar']

# TODO change language to be variable
stanza.download('hi')
nlp = stanza.Pipeline('hi')

en_str = "Barack Obama was born in Hawaii"
it_str = "Barack Obama è nato alle Hawaii"
hi_str = "बराक ओबामा का जन्म हवाई में हुआ था"
ar_str = 'الأردن أو (رسمياً: المملكة الأردنية الهاشمية) هي دولة عربية تقع في جنوب غرب آسيا، تتوسط الشرق الأوسط بوقوعها في الجزء الجنوبي من منطقة بلاد الشام، والشمالي لمنطقة شبه الجزيرة العربية. لها حدود مشتركة مع كل من سوريا من الشمال، فلسطين من الغرب، العراق من الشرق، وتحدها شرقًا وجنوبًا المملكة العربية السعودية، كما تطل على خليج العقبة في الجنوب الغربي، حيث تطل مدينة العقبة على البحر الأحمر، ويعتبر هذا المنفذ البحري الوحيد للأردن. سميت بالأردن نسبة إلى نهر الأردن الذي يمر على حدودها الغربية.يُعتبر الأردن بلداً يجمع بين ثقافات ولهجات عربية مختلفة بشكل ملفت، ولا تفصله أي حدود طبيعية عن جيرانه العرب سوى نهر الأردن ونهر اليرموك اللذين يشكلان على التوالي جزءاً من حدوده مع فلسطين وسوريا. أما باقي الحدود فهي امتداد لبادية الشام في الشمال والشرق وصحراء النفوذ في الجنوب، ووادي عربة إلى الجنوب الغربي. تتنوع التضاريس بالأردن بشكل كبير، وأهم جباله جبال عجلون في الشمال الغربي، وجبال الشراة في الجنوب، أعلى قمة تلك الموجودة على جبل أم الدامي 1854 متر، وأخفض نقطة في البحر الميت والتي تعتبر أخفض نقطة في العالم.أسّس الأمير عبد الله بن الحسين عام 1921، إمارة شرق الأردن بمساعدة بريطانيا وكانت خاضعة آنذاك لفلسطين الانتدابية، استقلت عام 1946 ونودي بالأمير عبد الله ملكاً عليها، فعُرفت منذ ذلك الحين باسم المملكة الأردنية الهاشمية. النظام بالمملكة الأردنية الهاشمية هو نظام ملكي دستوري مع حكومة تمثيلية. الملك يمارس سلطته التنفيذية من خلال رئيس الوزراء ومجلس الوزراء، الذي في الوقت نفسه، هو مسؤول أمام مجلس النواب (المنتخب) ومجلس الأعيان (المُعَّين من قبل الملك) الذين يشكلان السلطة التشريعية للدولة. هناك أيضاً السلطة القضائية المستقلة.'

# TODO change string.
doc = nlp(hi_str)
print(*[f'word: {word.text}\tupos: {word.upos}\txpos: {word.xpos}\tfeats: {word.feats if word.feats else "_"}' for sent in doc.sentences for word in sent.words], sep='\n')
print(doc)
print("ENTITIES")
print(doc.entities)